In [1]:
import numpy as np
import pandas as pd

In [2]:
data=np.random.randn(3,3)
data

array([[-0.13000186, -0.34274107,  0.1912401 ],
       [ 0.43125693,  0.03803179,  0.63520727],
       [-0.30823355,  1.21306601, -0.17229302]])

In [3]:
df=pd.DataFrame(data)

In [4]:
df

          0         1         2
0 -0.130002 -0.342741  0.191240
1  0.431257  0.038032  0.635207
2 -0.308234  1.213066 -0.172293

0. SÜTUNU GETİRDİ SATIRI DEĞİL

In [5]:
df[0]

0   -0.130002
1    0.431257
2   -0.308234
Name: 0, dtype: float64

In [6]:
yeni_df=pd.DataFrame(data=data,index=["x","y","z"],columns=["ali","ahmet","mehmet"])

In [7]:
yeni_df

        ali     ahmet    mehmet
x -0.130002 -0.342741  0.191240
y  0.431257  0.038032  0.635207
z -0.308234  1.213066 -0.172293

BU ŞEKİLDE DE OLUR İLLA İNDEX NUMARASI VERMEYE GEREK YOK İNDEX ADI DA GETİRİR SÜTUN OLARAK

In [8]:
yeni_df["ahmet"]

x   -0.342741
y    0.038032
z    1.213066
Name: ahmet, dtype: float64

İSTEDİĞİMİZ SÜTUNLARI BU ŞEKİLDE ALABİLİRİZ

In [9]:
yeni_df[["ahmet","mehmet"]]

      ahmet    mehmet
x -0.342741  0.191240
y  0.038032  0.635207
z  1.213066 -0.172293

İSTEDİĞİMİZ SATIRLARI DA ALMA YOLU VAR

BU SATIR ADI İLE SATIR ALMA YÖNTEMİ

In [10]:
yeni_df.loc["x"]

ali      -0.130002
ahmet    -0.342741
mehmet    0.191240
Name: x, dtype: float64

BU DA SATIR İNDEXİ İLE SATIR ALMA YÖNTEMİ

In [11]:
yeni_df.iloc[0]

ali      -0.130002
ahmet    -0.342741
mehmet    0.191240
Name: x, dtype: float64

# 6.5

In [12]:
yeni_df

        ali     ahmet    mehmet
x -0.130002 -0.342741  0.191240
y  0.431257  0.038032  0.635207
z -0.308234  1.213066 -0.172293

Kolon/sütun ekleme

In [13]:
yeni_df["kayzer"]=yeni_df["ali"]+yeni_df["ahmet"]

In [14]:
yeni_df

        ali     ahmet    mehmet    kayzer
x -0.130002 -0.342741  0.191240 -0.472743
y  0.431257  0.038032  0.635207  0.469289
z -0.308234  1.213066 -0.172293  0.904832

Kolon/sütun silme

BURADA axis=eksen YANİ EKSEN BELİRTMEDİK O YÜZDEN HATA VERDİ.

In [15]:
yeni_df.drop("kayzer")

KeyError: "['kayzer'] not found in axis"

BURADA x ekseni 0, y ekseni 1 DEMEKTİR. 

axis= DİYE BELİRTİLİR.

EKSENİ BELİRTİYORUZ

DİPNOT: SATIR SİLERKEN axis DEFAULT 0 DEĞERLİDİR. BELİRTMEYE GEREK YOKTUR FAKAT BELİRTMEK DAHA İYİDİR

In [16]:
yeni_df.drop("kayzer",axis=1)

        ali     ahmet    mehmet
x -0.130002 -0.342741  0.191240
y  0.431257  0.038032  0.635207
z -0.308234  1.213066 -0.172293

In [17]:
yeni_df

        ali     ahmet    mehmet    kayzer
x -0.130002 -0.342741  0.191240 -0.472743
y  0.431257  0.038032  0.635207  0.469289
z -0.308234  1.213066 -0.172293  0.904832

inplace metodu YAPTIĞIMIZ DEĞİŞİKLERİN KALICI OLMASI İÇİN

In [54]:
yeni_df["necmi"]=yeni_df["ahmet"]+yeni_df["mehmet"]
yeni_df

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

# ÖNEMLİ !! 

# yeni_df2 DE YAPTIĞIM DEĞİŞİKLİK yeni_df Yİ DE ETKİLİYOR 

# ÇÖZÜMÜ YAPALIM

# ÇÖZÜM .copy() BUNU GÖRMÜŞTÜK DAHA ÖNCE DE !!

In [55]:
yeni_df2=yeni_df.copy()
yeni_df2

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

In [57]:
yeni_df2.drop("necmi",axis=1)
yeni_df2

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

In [58]:
yeni_df

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

BURADA inplace DEĞERİNİ True YAPIYORUM

DİPNOT inplace BOOL DEĞER DÖNDÜRÜR True/False

In [59]:
yeni_df2.drop("necmi",axis=1,inplace=True)
# BURADA HATA VERDİ BİR KERE SİLDİĞİM İÇİN AMA SİZ ANLADINIZ

# ÖNEMLİ !! 

# yeni_df2 DE YAPTIĞIM DEĞİŞİKLİK yeni_df Yİ DE ETKİLİYOR 

# BURADA FARKEDİYORUZ YUKARIDA ÇÖZÜMÜ YAPACAĞIZ YUKARI GEÇELİM

In [60]:
yeni_df

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

In [61]:
yeni_df2

        ali     ahmet    mehmet    kayzer
x -0.130002 -0.342741  0.191240 -0.472743
y  0.431257  0.038032  0.635207  0.469289
z -0.308234  1.213066 -0.172293  0.904832

BİR DEĞERİ GETİRME

In [25]:
yeni_df.loc["x"]["ali"]

-0.13000186275450598

İKİSİ DE AYNI ŞEY

In [26]:
yeni_df.loc["x","ali"]

-0.13000186275450598

DATAFRAME LERDE BİRAZ SORGU YAPALIM

In [27]:
yeni_df[yeni_df>0]

        ali     ahmet    mehmet    kayzer     necmi
x       NaN       NaN  0.191240       NaN       NaN
y  0.431257  0.038032  0.635207  0.469289  0.673239
z       NaN  1.213066       NaN  0.904832  1.040773

In [28]:
yeni_df[yeni_df["ahmet"]>-1]

        ali     ahmet    mehmet    kayzer     necmi
x -0.130002 -0.342741  0.191240 -0.472743 -0.151501
y  0.431257  0.038032  0.635207  0.469289  0.673239
z -0.308234  1.213066 -0.172293  0.904832  1.040773

6.6

In [29]:
yeni_df3=pd.DataFrame(data=np.random.randn(4,3),index=["Ali","Buğra","Oktay","yusuf"],columns=["maas","yas","calisma saati"])

In [30]:
yeni_df3

           maas       yas  calisma saati
Ali   -0.701473 -1.903183       0.481596
Buğra -0.184898 -0.157002       0.828718
Oktay -0.240317 -0.864035       0.088552
yusuf -1.173973 -1.461919       0.588196

İNDEX SÜTUNU AÇIYOR indexi sıfırlıyor

In [31]:
yeni_df3.reset_index()

   index      maas       yas  calisma saati
0    Ali -0.701473 -1.903183       0.481596
1  Buğra -0.184898 -0.157002       0.828718
2  Oktay -0.240317 -0.864035       0.088552
3  yusuf -1.173973 -1.461919       0.588196

In [32]:
yeni_df3

           maas       yas  calisma saati
Ali   -0.701473 -1.903183       0.481596
Buğra -0.184898 -0.157002       0.828718
Oktay -0.240317 -0.864035       0.088552
yusuf -1.173973 -1.461919       0.588196

In [33]:
yeni_df3.set_index("yas")

               maas  calisma saati
yas
-1.903183 -0.701473       0.481596
-0.157002 -0.184898       0.828718
-0.864035 -0.240317       0.088552
-1.461919 -1.173973       0.588196

In [34]:
yeni_df_index=["ali","bug","okt","yus"]
yeni_df3["yeni index"]=yeni_df_index
yeni_df3

           maas       yas  calisma saati yeni index
Ali   -0.701473 -1.903183       0.481596        ali
Buğra -0.184898 -0.157002       0.828718        bug
Oktay -0.240317 -0.864035       0.088552        okt
yusuf -1.173973 -1.461919       0.588196        yus

6.7 MULTİ İNDEKS

EĞER BİRDEN FAZLA SÜTUN İNDEX İSTİYORSANIZ

In [35]:
dis_indeksler=["simp","simp","simp","spark","spark","spark"]

In [36]:
ic_indeksler=["homer","bart","marge","merge","necmi","mahmut"]

İNDEKSLERİ BİRLEŞTİRİYOR 

TUPLE DÖNDÜRÜYOR

In [37]:
birlesmis_indeks=list(zip(dis_indeksler,ic_indeksler))

In [38]:
birlesmis_indeks

[('simp', 'homer'),
 ('simp', 'bart'),
 ('simp', 'marge'),
 ('spark', 'merge'),
 ('spark', 'necmi'),
 ('spark', 'mahmut')]

In [39]:
type(birlesmis_indeks)

list

TUPLE'DAN MULTİ İNDEKS

In [40]:
birlesmis_indeks=pd.MultiIndex.from_tuples(birlesmis_indeks)

In [41]:
birlesmis_indeks

MultiIndex([( 'simp',  'homer'),
            ( 'simp',   'bart'),
            ( 'simp',  'marge'),
            ('spark',  'merge'),
            ('spark',  'necmi'),
            ('spark', 'mahmut')],
           )

In [42]:
my_list=[[40,"a"],[25,"b"],[32,"c"],[43,"d"],[16,"e"],[92,"f"]]

In [43]:
my_list_df=pd.DataFrame(data=my_list,index=birlesmis_indeks,columns=["age","job"])

SONUÇ :

In [44]:
my_list_df

              age job
simp  homer    40   a
      bart     25   b
      marge    32   c
spark merge    43   d
      necmi    16   e
      mahmut   92   f

In [45]:
my_list_df.loc["simp"]

       age job
homer   40   a
bart    25   b
marge   32   c

In [46]:
my_list_df.loc["simp","bart"]

age    25
job     b
Name: (simp, bart), dtype: object

Name KISMINDA FARKLILIK VAR

In [47]:
my_list_df.loc["simp"].loc["bart"]

age    25
job     b
Name: bart, dtype: object

MULTİ İNDEXLERİN ADLARINI DEĞİŞTİRİYORUZ O YÜZDEN 

name var

In [48]:
my_list_df.index.names=["dizi","karakterler"]

In [49]:
my_list_df

                   age job
dizi  karakterler
simp  homer         40   a
      bart          25   b
      marge         32   c
spark merge         43   d
      necmi         16   e
      mahmut        92   f